webservice/src/main/java/com/walterwhites/library/webservice/test/request_book.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="jaxb.consumer.library.walterwhites.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getBookRequest>
            <gs:title>harry potter</gs:title>
        </gs:getBookRequest>
    </soapenv:Body>
</soapenv:Envelope>